# ElementsSketchTooLarge Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SketchFailures..::..ElementsSketchTooLarge Property
BuiltInFailures..::..SketchFailures Class See Also
---
The sketch defining the highlighted element is too large.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ElementsSketchTooLarge { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ElementsSketchTooLarge As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ElementsSketchTooLarge {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SketchFailures Class
Autodesk.Revit.DB Namespace